TESTRUN1-HOST0-COMPR/fio-benchmark-output/Test05-Typewrite-BS1024k-DeviceCount05.txt
test1-subtest1-blocksize1024k-threads1-device1of5: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
test1-subtest1-blocksize1024k-threads1-device2of5: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
test1-subtest1-blocksize1024k-threads1-device3of5: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
test1-subtest1-blocksize1024k-threads1-device4of5: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
test1-subtest1-blocksize1024k-threads1-device5of5: (g=0): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
test1-subtest2-blocksize1024k-threads2-device1of5: (g=1): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest2-blocksize1024k-threads2-device2of5: (g=1): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest2-blocksize1024k-threads2-device3of5: (g=1): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest2-blocksize1024k-threads2-device4of5: (g=1): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest2-blocksize1024k-threads2-device5of5: (g=1): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest3-blocksize1024k-threads3-device1of5: (g=2): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest3-blocksize1024k-threads3-device2of5: (g=2): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest3-blocksize1024k-threads3-device3of5: (g=2): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest3-blocksize1024k-threads3-device4of5: (g=2): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest3-blocksize1024k-threads3-device5of5: (g=2): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest4-blocksize1024k-threads4-device1of5: (g=3): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest4-blocksize1024k-threads4-device2of5: (g=3): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest4-blocksize1024k-threads4-device3of5: (g=3): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest4-blocksize1024k-threads4-device4of5: (g=3): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest4-blocksize1024k-threads4-device5of5: (g=3): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest5-blocksize1024k-threads5-device1of5: (g=4): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest5-blocksize1024k-threads5-device2of5: (g=4): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest5-blocksize1024k-threads5-device3of5: (g=4): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest5-blocksize1024k-threads5-device4of5: (g=4): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest5-blocksize1024k-threads5-device5of5: (g=4): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest6-blocksize1024k-threads6-device1of5: (g=5): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest6-blocksize1024k-threads6-device2of5: (g=5): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest6-blocksize1024k-threads6-device3of5: (g=5): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest6-blocksize1024k-threads6-device4of5: (g=5): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest6-blocksize1024k-threads6-device5of5: (g=5): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest7-blocksize1024k-threads7-device1of5: (g=6): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest7-blocksize1024k-threads7-device2of5: (g=6): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest7-blocksize1024k-threads7-device3of5: (g=6): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest7-blocksize1024k-threads7-device4of5: (g=6): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest7-blocksize1024k-threads7-device5of5: (g=6): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest8-blocksize1024k-threads8-device1of5: (g=7): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest8-blocksize1024k-threads8-device2of5: (g=7): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest8-blocksize1024k-threads8-device3of5: (g=7): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest8-blocksize1024k-threads8-device4of5: (g=7): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest8-blocksize1024k-threads8-device5of5: (g=7): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest9-blocksize1024k-threads9-device1of5: (g=8): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest9-blocksize1024k-threads9-device2of5: (g=8): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest9-blocksize1024k-threads9-device3of5: (g=8): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest9-blocksize1024k-threads9-device4of5: (g=8): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest9-blocksize1024k-threads9-device5of5: (g=8): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest10-blocksize1024k-threads10-device1of5: (g=9): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest10-blocksize1024k-threads10-device2of5: (g=9): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest10-blocksize1024k-threads10-device3of5: (g=9): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest10-blocksize1024k-threads10-device4of5: (g=9): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
test1-subtest10-blocksize1024k-threads10-device5of5: (g=9): rw=write, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
...
fio-3.12
Starting 275 processes

test1-subtest1-blocksize1024k-threads1-device1of5: (groupid=0, jobs=5): err= 0: pid=4099: Sat Jan 12 11:34:06 2019
  write: IOPS=2412, BW=2413MiB/s (2530MB/s)(141GiB/60003msec)
    slat (usec): min=18, max=112, avg=32.09, stdev= 5.19
    clat (usec): min=1236, max=65570, avg=2039.01, stdev=804.81
     lat (usec): min=1261, max=65604, avg=2071.18, stdev=805.19
    clat percentiles (usec):
     |  1.00th=[ 1287],  5.00th=[ 1336], 10.00th=[ 1385], 20.00th=[ 1483],
     | 30.00th=[ 1582], 40.00th=[ 1663], 50.00th=[ 1811], 60.00th=[ 1958],
     | 70.00th=[ 2180], 80.00th=[ 2474], 90.00th=[ 2933], 95.00th=[ 3523],
     | 99.00th=[ 4948], 99.50th=[ 5604], 99.90th=[ 7767], 99.95th=[ 8717],
     | 99.99th=[11863]
   bw (  MiB/s): min= 2186, max= 2575, per=99.63%, avg=2404.05, stdev=14.06, samples=596
   iops        : min= 2185, max= 2575, avg=2402.90, stdev=14.12, samples=596
  lat (msec)   : 2=62.35%, 4=34.55%, 10=3.07%, 20=0.03%, 50=0.01%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.85%, sys=0.86%, ctx=146678, majf=0, minf=82
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,144787,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
test1-subtest2-blocksize1024k-threads2-device1of5: (groupid=1, jobs=10): err= 0: pid=4438: Sat Jan 12 11:34:06 2019
  write: IOPS=3931, BW=3932MiB/s (4123MB/s)(230GiB/60002msec)
    slat (usec): min=18, max=127, avg=33.16, stdev= 5.01
    clat (usec): min=1229, max=76170, avg=2509.19, stdev=1011.18
     lat (usec): min=1255, max=76200, avg=2542.43, stdev=1011.26
    clat percentiles (usec):
     |  1.00th=[ 1319],  5.00th=[ 1385], 10.00th=[ 1434], 20.00th=[ 1614],
     | 30.00th=[ 1876], 40.00th=[ 2180], 50.00th=[ 2376], 60.00th=[ 2671],
     | 70.00th=[ 2933], 80.00th=[ 3163], 90.00th=[ 3556], 95.00th=[ 4113],
     | 99.00th=[ 5604], 99.50th=[ 6194], 99.90th=[ 8160], 99.95th=[10028],
     | 99.99th=[15664]
   bw (  MiB/s): min= 3062, max= 4098, per=91.14%, avg=3583.37, stdev=24.94, samples=1191
   iops        : min= 3058, max= 4095, avg=3578.73, stdev=24.97, samples=1191
  lat (msec)   : 2=34.04%, 4=60.28%, 10=5.63%, 20=0.04%, 50=0.01%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.69%, sys=0.75%, ctx=239944, majf=0, minf=164
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,235915,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
test1-subtest3-blocksize1024k-threads3-device1of5: (groupid=2, jobs=15): err= 0: pid=4712: Sat Jan 12 11:34:06 2019
  write: IOPS=4669, BW=4670MiB/s (4897MB/s)(274GiB/60006msec)
    slat (usec): min=18, max=118, avg=33.61, stdev= 5.16
    clat (usec): min=1245, max=64613, avg=3177.24, stdev=1293.22
     lat (usec): min=1279, max=64649, avg=3210.93, stdev=1293.93
    clat percentiles (usec):
     |  1.00th=[ 1336],  5.00th=[ 1450], 10.00th=[ 1549], 20.00th=[ 1745],
     | 30.00th=[ 2278], 40.00th=[ 2835], 50.00th=[ 3228], 60.00th=[ 3621],
     | 70.00th=[ 3949], 80.00th=[ 4228], 90.00th=[ 4621], 95.00th=[ 5080],
     | 99.00th=[ 6390], 99.50th=[ 6980], 99.90th=[ 9110], 99.95th=[10683],
     | 99.99th=[13435]
   bw (  MiB/s): min= 3017, max= 4825, per=81.05%, avg=3784.90, stdev=35.83, samples=1791
   iops        : min= 3013, max= 4821, avg=3778.96, stdev=35.86, samples=1791
  lat (msec)   : 2=26.58%, 4=45.03%, 10=28.32%, 20=0.06%, 50=0.01%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.57%, sys=0.58%, ctx=286837, majf=0, minf=237
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,280225,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
test1-subtest4-blocksize1024k-threads4-device1of5: (groupid=3, jobs=20): err= 0: pid=4988: Sat Jan 12 11:34:06 2019
  write: IOPS=5247, BW=5248MiB/s (5503MB/s)(308GiB/60005msec)
    slat (usec): min=18, max=203, avg=36.22, stdev= 5.89
    clat (usec): min=1274, max=69774, avg=3773.85, stdev=1781.37
     lat (usec): min=1308, max=69801, avg=3810.15, stdev=1782.79
    clat percentiles (usec):
     |  1.00th=[ 1467],  5.00th=[ 1565], 10.00th=[ 1565], 20.00th=[ 1729],
     | 30.00th=[ 1876], 40.00th=[ 3294], 50.00th=[ 4293], 60.00th=[ 4686],
     | 70.00th=[ 5080], 80.00th=[ 5407], 90.00th=[ 5735], 95.00th=[ 6063],
     | 99.00th=[ 7242], 99.50th=[ 7898], 99.90th=[10421], 99.95th=[12387],
     | 99.99th=[16188]
   bw (  MiB/s): min= 3178, max= 5412, per=83.27%, avg=4369.73, stdev=38.41, samples=2387
   iops        : min= 3174, max= 5406, avg=4361.95, stdev=38.44, samples=2387
  lat (msec)   : 2=34.27%, 4=11.67%, 10=53.94%, 20=0.11%, 50=0.01%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.53%, sys=0.52%, ctx=323963, majf=0, minf=326
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,314882,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
test1-subtest5-blocksize1024k-threads5-device1of5: (groupid=4, jobs=25): err= 0: pid=5324: Sat Jan 12 11:34:06 2019
  write: IOPS=5676, BW=5676MiB/s (5952MB/s)(333GiB/60007msec)
    slat (usec): min=18, max=169, avg=36.03, stdev= 6.57
    clat (usec): min=1302, max=58778, avg=4366.86, stdev=2359.23
     lat (usec): min=1326, max=58820, avg=4402.98, stdev=2361.56
    clat percentiles (usec):
     |  1.00th=[ 1467],  5.00th=[ 1565], 10.00th=[ 1631], 20.00th=[ 1762],
     | 30.00th=[ 1942], 40.00th=[ 2409], 50.00th=[ 4883], 60.00th=[ 5735],
     | 70.00th=[ 6325], 80.00th=[ 6783], 90.00th=[ 7111], 95.00th=[ 7439],
     | 99.00th=[ 8717], 99.50th=[ 9241], 99.90th=[10945], 99.95th=[12125],
     | 99.99th=[15926]
   bw (  MiB/s): min= 3957, max= 5801, per=83.01%, avg=4712.27, stdev=27.19, samples=2978
   iops        : min= 3949, max= 5792, avg=4700.87, stdev=27.20, samples=2978
  lat (msec)   : 2=32.63%, 4=11.95%, 10=55.22%, 20=0.20%, 50=0.01%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.49%, sys=0.40%, ctx=343047, majf=0, minf=401
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,340626,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
test1-subtest6-blocksize1024k-threads6-device1of5: (groupid=5, jobs=30): err= 0: pid=5586: Sat Jan 12 11:34:06 2019
  write: IOPS=5872, BW=5872MiB/s (6158MB/s)(344GiB/60008msec)
    slat (usec): min=17, max=161, avg=35.73, stdev= 8.43
    clat (usec): min=1295, max=76656, avg=5071.47, stdev=2886.76
     lat (usec): min=1327, max=76699, avg=5107.28, stdev=2889.93
    clat percentiles (usec):
     |  1.00th=[ 1516],  5.00th=[ 1647], 10.00th=[ 1762], 20.00th=[ 1975],
     | 30.00th=[ 2278], 40.00th=[ 2606], 50.00th=[ 6259], 60.00th=[ 6980],
     | 70.00th=[ 7242], 80.00th=[ 7635], 90.00th=[ 8455], 95.00th=[ 9241],
     | 99.00th=[10159], 99.50th=[10552], 99.90th=[12911], 99.95th=[14877],
     | 99.99th=[19792]
   bw (  MiB/s): min= 4070, max= 6055, per=87.66%, avg=5147.83, stdev=17.46, samples=3579
   iops        : min= 4061, max= 6048, avg=5138.96, stdev=17.48, samples=3579
  lat (msec)   : 2=21.69%, 4=24.23%, 10=52.48%, 20=1.60%, 50=0.01%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.42%, sys=0.34%, ctx=357248, majf=0, minf=479
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,352394,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
test1-subtest7-blocksize1024k-threads7-device1of5: (groupid=6, jobs=35): err= 0: pid=5915: Sat Jan 12 11:34:06 2019
  write: IOPS=6027, BW=6027MiB/s (6320MB/s)(354GiB/60068msec)
    slat (usec): min=18, max=124, avg=42.84, stdev=12.66
    clat (usec): min=1315, max=95808, avg=5757.04, stdev=3431.72
     lat (usec): min=1347, max=95852, avg=5799.97, stdev=3439.86
    clat percentiles (usec):
     |  1.00th=[ 1549],  5.00th=[ 1713], 10.00th=[ 1860], 20.00th=[ 2147],
     | 30.00th=[ 2507], 40.00th=[ 2933], 50.00th=[ 6718], 60.00th=[ 7767],
     | 70.00th=[ 8586], 80.00th=[ 9372], 90.00th=[10159], 95.00th=[10421],
     | 99.00th=[10814], 99.50th=[11338], 99.90th=[13173], 99.95th=[14746],
     | 99.99th=[25297]
   bw (  MiB/s): min= 3908, max= 6216, per=83.56%, avg=5036.47, stdev=19.25, samples=4177
   iops        : min= 3897, max= 6203, avg=5023.62, stdev=19.27, samples=4177
  lat (msec)   : 2=14.79%, 4=32.39%, 10=40.33%, 20=12.48%, 50=0.01%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.50%, sys=0.30%, ctx=365639, majf=0, minf=565
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,362045,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
test1-subtest8-blocksize1024k-threads8-device1of5: (groupid=7, jobs=40): err= 0: pid=6250: Sat Jan 12 11:34:06 2019
  write: IOPS=5959, BW=5959MiB/s (6249MB/s)(349GiB/60010msec)
    slat (usec): min=17, max=157, avg=36.59, stdev= 8.88
    clat (usec): min=1319, max=99138, avg=6674.21, stdev=3791.14
     lat (usec): min=1347, max=99179, avg=6710.88, stdev=3794.10
    clat percentiles (usec):
     |  1.00th=[ 1565],  5.00th=[ 1795], 10.00th=[ 2114], 20.00th=[ 2671],
     | 30.00th=[ 3195], 40.00th=[ 3458], 50.00th=[ 8586], 60.00th=[ 9372],
     | 70.00th=[10290], 80.00th=[10552], 90.00th=[10814], 95.00th=[11076],
     | 99.00th=[11863], 99.50th=[12387], 99.90th=[14091], 99.95th=[16057],
     | 99.99th=[20579]
   bw (  MiB/s): min= 4324, max= 6162, per=85.63%, avg=5102.95, stdev=12.72, samples=4768
   iops        : min= 4308, max= 6144, avg=5084.61, stdev=12.73, samples=4768
  lat (msec)   : 2=8.26%, 4=38.08%, 10=19.33%, 20=34.33%, 50=0.01%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.32%, sys=0.28%, ctx=363532, majf=0, minf=648
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,357606,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
test1-subtest9-blocksize1024k-threads9-device1of5: (groupid=8, jobs=45): err= 0: pid=6542: Sat Jan 12 11:34:06 2019
  write: IOPS=6153, BW=6153MiB/s (6452MB/s)(361GiB/60012msec)
    slat (usec): min=18, max=135, avg=39.05, stdev=10.55
    clat (usec): min=1319, max=95964, avg=7272.23, stdev=4367.84
     lat (usec): min=1351, max=96016, avg=7311.36, stdev=4373.74
    clat percentiles (usec):
     |  1.00th=[ 1663],  5.00th=[ 2040], 10.00th=[ 2311], 20.00th=[ 2769],
     | 30.00th=[ 3228], 40.00th=[ 3556], 50.00th=[ 9241], 60.00th=[10552],
     | 70.00th=[10945], 80.00th=[11600], 90.00th=[12387], 95.00th=[13042],
     | 99.00th=[13829], 99.50th=[14091], 99.90th=[16188], 99.95th=[18744],
     | 99.99th=[24773]
   bw (  MiB/s): min= 3619, max= 6302, per=83.32%, avg=5126.86, stdev=22.03, samples=5373
   iops        : min= 3602, max= 6286, avg=5106.50, stdev=22.06, samples=5373
  lat (msec)   : 2=4.69%, 4=42.58%, 10=5.56%, 20=47.14%, 50=0.03%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.34%, sys=0.24%, ctx=373506, majf=0, minf=730
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,369270,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1
test1-subtest10-blocksize1024k-threads10-device1of5: (groupid=9, jobs=50): err= 0: pid=6920: Sat Jan 12 11:34:06 2019
  write: IOPS=6127, BW=6128MiB/s (6425MB/s)(359GiB/60012msec)
    slat (usec): min=18, max=214, avg=42.79, stdev=14.06
    clat (usec): min=1380, max=98530, avg=8114.94, stdev=4832.44
     lat (usec): min=1402, max=98594, avg=8157.82, stdev=4840.19
    clat percentiles (usec):
     |  1.00th=[ 1762],  5.00th=[ 2180], 10.00th=[ 2540], 20.00th=[ 3163],
     | 30.00th=[ 3720], 40.00th=[ 4047], 50.00th=[10159], 60.00th=[11469],
     | 70.00th=[12387], 80.00th=[13435], 90.00th=[13829], 95.00th=[14091],
     | 99.00th=[14484], 99.50th=[14877], 99.90th=[16909], 99.95th=[19006],
     | 99.99th=[24773]
   bw (  MiB/s): min= 5664, max= 6451, per=100.00%, avg=6127.33, stdev= 3.56, samples=5987
   iops        : min= 5657, max= 6451, avg=6125.30, stdev= 3.57, samples=5987
  lat (msec)   : 2=3.02%, 4=35.88%, 10=10.75%, 20=50.31%, 50=0.03%
  lat (msec)   : 100=0.01%
  cpu          : usr=0.34%, sys=0.23%, ctx=373889, majf=0, minf=780
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,367730,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=2413MiB/s (2530MB/s), 2413MiB/s-2413MiB/s (2530MB/s-2530MB/s), io=141GiB (152GB), run=60003-60003msec

Run status group 1 (all jobs):
  WRITE: bw=3932MiB/s (4123MB/s), 3932MiB/s-3932MiB/s (4123MB/s-4123MB/s), io=230GiB (247GB), run=60002-60002msec

Run status group 2 (all jobs):
  WRITE: bw=4670MiB/s (4897MB/s), 4670MiB/s-4670MiB/s (4897MB/s-4897MB/s), io=274GiB (294GB), run=60006-60006msec

Run status group 3 (all jobs):
  WRITE: bw=5248MiB/s (5503MB/s), 5248MiB/s-5248MiB/s (5503MB/s-5503MB/s), io=308GiB (330GB), run=60005-60005msec

Run status group 4 (all jobs):
  WRITE: bw=5676MiB/s (5952MB/s), 5676MiB/s-5676MiB/s (5952MB/s-5952MB/s), io=333GiB (357GB), run=60007-60007msec

Run status group 5 (all jobs):
  WRITE: bw=5872MiB/s (6158MB/s), 5872MiB/s-5872MiB/s (6158MB/s-6158MB/s), io=344GiB (370GB), run=60008-60008msec

Run status group 6 (all jobs):
  WRITE: bw=6027MiB/s (6320MB/s), 6027MiB/s-6027MiB/s (6320MB/s-6320MB/s), io=354GiB (380GB), run=60068-60068msec

Run status group 7 (all jobs):
  WRITE: bw=5959MiB/s (6249MB/s), 5959MiB/s-5959MiB/s (6249MB/s-6249MB/s), io=349GiB (375GB), run=60010-60010msec

Run status group 8 (all jobs):
  WRITE: bw=6153MiB/s (6452MB/s), 6153MiB/s-6153MiB/s (6452MB/s-6452MB/s), io=361GiB (387GB), run=60012-60012msec

Run status group 9 (all jobs):
  WRITE: bw=6128MiB/s (6425MB/s), 6128MiB/s-6128MiB/s (6425MB/s-6425MB/s), io=359GiB (386GB), run=60012-60012msec

Disk stats (read/write):
    dm-21: ios=355/482771, merge=0/0, ticks=239/3557097, in_queue=3557536, util=99.45%, aggrios=98/120696, aggrmerge=0/0, aggrticks=65/887684, aggrin_queue=887350, aggrutil=93.96%
  sddk: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  sdcd: ios=199/241392, merge=0/0, ticks=135/1779783, in_queue=1779132, util=93.96%
  sdaw: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  sdp: ios=196/241394, merge=0/0, ticks=126/1770954, in_queue=1770269, util=93.93%
    dm-22: ios=330/1453704, merge=0/0, ticks=204/3525956, in_queue=3526320, util=99.45%, aggrios=92/363431, aggrmerge=0/0, aggrticks=54/877785, aggrin_queue=876547, aggrutil=93.70%
  sdbb: ios=186/726862, merge=0/0, ticks=116/1753815, in_queue=1751377, util=93.70%
  sdci: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  sdu: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  sddp: ios=184/726864, merge=0/0, ticks=102/1757325, in_queue=1754814, util=93.67%
    dm-23: ios=351/482845, merge=0/0, ticks=200/3556713, in_queue=3557227, util=99.47%, aggrios=97/120715, aggrmerge=0/0, aggrticks=51/887659, aggrin_queue=887296, aggrutil=94.01%
  sddq: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  sdbc: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  sdcj: ios=195/241430, merge=0/0, ticks=89/1779198, in_queue=1778463, util=93.99%
  sdv: ios=196/241430, merge=0/0, ticks=115/1771441, in_queue=1770724, util=94.01%
    dm-24: ios=360/483456, merge=0/0, ticks=213/3557305, in_queue=3557905, util=99.49%, aggrios=100/120867, aggrmerge=0/0, aggrticks=57/887670, aggrin_queue=887290, aggrutil=94.01%
  sdbk: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  sdcr: ios=199/241737, merge=0/0, ticks=112/1778402, in_queue=1777607, util=94.01%
  sddy: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  sdad: ios=201/241734, merge=0/0, ticks=116/1772281, in_queue=1771553, util=94.00%
    dm-25: ios=362/483062, merge=0/0, ticks=257/3557141, in_queue=3557569, util=99.50%, aggrios=100/120768, aggrmerge=0/0, aggrticks=66/887712, aggrin_queue=887335, aggrutil=94.02%
  sdab: ios=200/241539, merge=0/0, ticks=140/1771934, in_queue=1771183, util=94.02%
  sdbi: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%
  sdcp: ios=202/241536, merge=0/0, ticks=127/1778914, in_queue=1778158, util=94.01%
  sddw: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%